'''
Якщо в одновимірному масиві є три поспіль однакових елемента, то змінній r привласнити значення істина.
Bиконала Новіцька В. І. 122Б
'''
import random
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову
    print()  # відступ для більшої читабельності виведених користувачеві даних
    A = []  # масив з 100 значень
    for i in range(100):
        a = random.randint(0, 10)  # заповнимо масив рандомними числами
        A.append(a)
    print(f'Your array: \n{A}')

    r = False  # змінна отримає True, якщо знайдеться 3 однакових значення підряд
    count = 0  # к-ть однакових значень підряд

    for i in range(len(A)-1):
        while count < 4:
            if A[i] == A[i+1]:
                count += 1
                A_1 = A[i]  # збережемо в змінну A_1 це значення, що повторюється

            elif (A[i] != A[i+1]) and (count == 1):
                count = 0
                # цей варіант необхідно врахувати на випадок, якщо знайдеться два однакових елемента, а третій буде
                # іншим, тоді змінну count обнуляємо, і продовжуємо пошук 3 однакових підряд
            break

    if count > 2:
        # якщо за два порівняння попередній елемент дорівнював наступному, то маємо 3 однакових елемента підряд
        r = True

    A_1 = []  # масив з елементами, що повторюються 3 і більше разів
    for i in range(len(A)-2):
        if A[i] == A[i+1] == A[i+2]:
            A_1.append(A[i])
            # якщо 3 елементи підряд однакові, додаємо їх у масив A_1
            # (сюди також можуть входити елементи, що повторюються більше 3 разів)

    print(r)
    if r == True:
        print(f'Elements, repeated 3 or more times found: \n{set(A_1)}')
        # перетворимо список у множину за допомогою set(), що прибрати дублікати

    elif count == 0:
        print('No elements repeated 3 or more times found ')

        # count показує к-ть порівнянь, тобто к-ть однакових елементів завжди на 1 більша

    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться