'''
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Bиконала Новіцька В. І. 122Б
'''
import random
A = [] # масив з 12 значеннями температур
for i in range(10, -3, -1): # нехай температура знижувалась з 10 до -2. згенеруємо цей масив
    A.append(i)
H = [] # масив з годинами
for i in range(8,21):
   H.append((str(i)+" O'clock")) # у змінну Н записується значення години + слово O'clock
T = dict(zip(H,A)) # утворюється словник, де ключем є година, а значенням є відповідна їй температура
print(f'Hours and temperatures: \n{T}')
i = 0
while i < 13 and A[i] >= 0: # за допомогою циклу знайдемо індекс першої від'ємної температури
    i += 1
print(f"First negative temperature ({A[i]} degrees) was spotted at {A.index(A[i])+8} O'clock")
# відлік годин починається з 8, а масив А зі значеннями температур починається з 0, тому можемо додати +8 до знайденого
# індексу, що отримати годину, о якій отримали цю температуру
