'''
Знайти найбільший елемент з елементів одновимірного масиву, що мають парний номер. Визначити, чи є він єдиним.
Bиконала Новіцька В. І. 122Б
'''
import random
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову
    A = []  # масив з 100 значеннями
    for i in range(100):
        A.append(random.randint(0, 100))  # заповнимо масив рандомними числами
    print(f'Your array: \n{A}')

    B = []  # масив з парними елементами
    for i in A:
        if i % 2 == 0:  # якщо остача від ділення елемента на 2 = 0, то він є парним, запишемо його до масиву В
            B.append(i)

    print(f'Max element: {max(B)}')  # максимальний елемент з парних
    count_B = B.count(max(B))  # функція count() рахує к-ть повторів
    print(f'{max(B)} is repeated {count_B} times')  # виводить інформацію про те, скільки разів елемент повторився

    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться