'''
Розсортуйте заданий лінійний масив по зростанню.
Bиконала Новіцька В. І. 122Б
'''
A = [2, -34, 12, 0, -2, 6, 45, -78, 9, -10] # масив з 10 значеннями
print(f'Your array: {A}')

def growing_order_bubble(A):  # cортування бульбашкою за зростанням
    for i in range(len(A) - 1, 0, -1):
        for j in range(i):
            if A[j] > A[j + 1]:
                A[j], A[j + 1] = A[j + 1], A[j]
    # за допомогою циклів відбувається проходження по всім елементам і порівняння кожного елемента з наступним.
    # якщо він більший за наступний, то вони міняються місцями.
    # вкінці першої ітерації першого циклу for найбільший елемент вже стоїть на останній позиції,
    # тому наступна ітерація буде здійснюватись до цього елементу, і так доки всі елементи не будуть відсортовані у порядку зростання
    return A  # повертає відсортований масив
A_sort = growing_order_bubble(A)
print(f'Your array A sorted in growing order: {A_sort}')