'''
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
екран значення корeня і квадратів кожного з елементів масиву.
Виконала Новіцька В. І. 122Б
'''
import math
x = [16, 4, 25, 9, 36]
x_sq_root = []  # масив з квадратами елементів масиву х
x_sq = []  # масив з квадратними коренями елементів масиву х
print(f'\nYour array: {x}')

for i in x:
    x_sq.append(i**2) # елементи з масиву х підносяться до 2 степеня і додаються до масиву x_sq
print(f'Your elements squared: {x_sq}')

for j in x:
    x_sq_root.append(math.sqrt(j)) # знаходяться квадратні корені елементів з масиву х і додаються до масиву x_sq_root
print(f'Your elements root squared: {x_sq_root}')
