'''
Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
Bиконала Новіцька В. І. 122Б
'''
A = [-5, 23, 0, -12, 4, 19, -2, 8, 45, 6] # масив з 10 значеннями
print(f'Your array: {A}')
mult_A = 1 # добуток всіх елементів масиву менших за 0
for i in A:
    if i < 0: # якщо елемент менший за 0, то він множиться на змінну mult_A
        mult_A *= i
print(f'Multiplication of all elements less than 0: {mult_A}')