'''
Дано два лінійних масиви однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Bиконала Новіцька В. І. 122Б
'''
import random
import numpy as np
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову

    print()  # відступ для більшої читабельності виведених користувачеві даних
    A = np.zeros((10), dtype=int)  # створюємо масив А з 10 елементів і заповнюємо його нулями
    for i in range(10):  # генеруємо елементи масиву А
        A[i] = random.randint(-10, 10)
    print(f'Array A: {A}')

    B = np.zeros((10), dtype=int)  # створюємо масив B з 10 елементів і заповнюємо його нулями
    for i in range(10):  # генеруємо елементи масиву B
        B[i] = random.randint(-10, 10)
    print(f'Array B: {B}')

    C = np.zeros((10), dtype=int)  # створюємо масив C з 10 елементів і заповнюємо його нулями
    for i in range(10):
        C[i] = A[i] * B[i]  # добуток елементів масивів А і В записується у масив С

    print(f'Array C (multiplication of A and B): {C}')

    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться