'''
Задано дві таблиці. Одна містить найменування послуг, а інша - розцінки за ці послуги. Видаліть з обох таблиць все,
що передує послузі, ціна якої G гривень.
Bиконала Новіцька В. І. 122Б
'''
A = ['Classic manicure', 'Gel manicure', 'Nail removal', 'Nail design', 'Polish change']  # масив з послугами манікюрного салону
B = [17, 35, 10, 15,5]  # масив з цінами манікюрного салону
C = list(zip(A,B))  # масив, у якому видно, яка послуга поєднана з якою ціною

G = int(input('Please input price: '))
print(f'Services and prices: \n{C}')

B_index = []  # в цьому масиві будуть знаходитись індекси елементів, нижчих за введене

for i in range(len(B)):
    if B[i] < G:
        B_index.append(i)
        # якщо елемент з масиву з цінами менший за число, введене користувачем, додаємо його в масив B_index

j = 0
for i in B_index:
    del A[i+j]  # видаляються елементи з першого і другого масивів з однаковими індексами
    del B[i+j]  #
    j -= 1
    # при видаленні якогось елементу к-ть індексів зменшується на один, через що при кожній ітерації потрібно відняти 1,
    # щоб повернути попередню к-ть ідексів
C = list(zip(A,B))  # створимо масив з тими з елементами з А і В після видалення зайвих елементів
print(f'Services with prices bigger than {G}: \n{C}')