'''
У лінійному масиві знайти максимальний елемент. Вставте порядковий
номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.
Bиконала Новіцька В. І. 122Б
'''
import numpy as np
import random
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову
    print()  # відступ для більшої читабельності виведених користувачеві даних
    A = []  # масив з 10 значеннями
    for i in range(10):
        a = random.randint(0, 20)  # заповнимо масив рандомними числами
        A.append(a)
    print(f'Your array: \n{A}')

    max_index = A.index(max(A))  # у змінну збережемо індекс максимальнго елемента

    A += [0]  # збільшимо масив на один елемент, щоб не загубити поточний останній елемент, коли будемо пересувати масив

    i = len(A) - 1
    while i > max_index:
        A[i] = A[i - 1]
        i -= 1
    # щоб пересунути всі елементи після максимально скористаємось циклом while ітерація якого починається з кінця.
    # на місце останнього елемента ставиться передостанній і так далі аж до максимального елемента.
    # перехід на наступний елемент (тобто назад, на попередній по номеру індексу) здійснюється за допомогою лічильника і

    A[max_index + 1] = max_index
    # вставляємо індекс максимального елемента наступним по порядку після самого максимального

    print(f'\nArray A with index of a maximum element stands right after this maximum element: \n{A}')
    print(f'Max element: {max(A)}, index = {max_index} ')


    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться