'''
Дан лінійний масив цілих чисел. Перевірте, чи є він упорядкованим по
спаданню.
Bиконала Новіцька В. І. 122Б
'''
A = [10, 9, 8, 7, 6 ,5, 4, 3, 2, 1]  # нехай задано відсортований у спадному порядку масив А
B = [3, 2, 4, 7, 3, 2]  # масив В у довільному порядку, для перевірки програми

def descending_f(A):
    g = 0
    for i in range(len(A)-1):  # len(A)-1 оскільки останній елемент не потрібно перевіряти, після нього немає елементів
        if A[i] > A[i + 1]:  # якщо елемент більший за наступний, додаємо +1 у змінну g
            g += 1

    if g == (len(A)-1):
        # якщо значення змінної g дорівнює максимально можливій кількості перевірок у масиві,
        # то робимо висновок, що весь масив відсортовано у спадному порядку
        print(f'\nArray {A} is sorted in descending order.')
    else:
        # масив не є відсортованим
        print(f'\nArray {A} is NOT sorted.')

descending_f(A)
descending_f(B)
# викличемо функцію для обох масивів, щоб побачити як вона працює