'''
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки разів температура була вище середньої за цю декаду.
Bиконала Новіцька В. І. 122Б
'''
import random
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову
    A = [] # масив з 10 значеннями температур у грудні
    for i in range(10):
        a = random.randint(-20, 0) # створимо значення температур рандомно
        A.append(a)
    print(f'Temperatures in December: {A}')
    sum_t = 0 # змінна з сумою всіх температур за декаду грудня

    for i in A:
        sum_t += i # в змінну sum_t записується сума всіх елементів масиву А
    av_t = (sum_t)/10 # змінна з середньою температурою за декаду грудня

    count = 0 # кількість разів, коли температура була вище середньої за цю декаду
    for i in A:
        if i > av_t: count += 1 # якщо у масиві знайдено температуру вищу за середню, у змінну count записується +1
    print(f'Number of days when temperatures in December is higher than average ({av_t} degrees): {count}')

    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться