'''
Дані про температуру повітря за декаду листопада зберігаються в масиві.
Визначити, скільки разів температура опускалася нижче -10 градусів.
Bиконала Новіцька В. І. 122Б
'''
import random
A = [] # масив з 10 значеннями температур в листопаді
for i in range(10):
    a = random.randint(-15, 5) # створимо значення температур рандомно
    A.append(a)
print(f'Temperatures in November: {A}')
count = 0 # кількість температур нижчих за 0
for i in A:
    if i < -10: count += 1 # якщо у масиві знайдено температуру меншу за -10, у змінну count записується +1
print(f'Number of temperatures below -10 in November: {count}')