'''
Обчислити суму парних елементів одновимірного масиву до першого
зустрінутого нульового елемента.
Bиконала Новіцька В. І. 122Б
'''
import numpy as np

B = np.array([4, 3, 12, 5, 0, 7, 8, 0, 13, 7])
print(f'Array B: {B}')

a_zero = 0  # в цій змінній зберігатиметься значення першого зустрінутого числа рівного наперед заданому числу а
B_even = []  # заведемо тестовий список, щоб побачити, які елементи програма розпізнала як парні
for i in range(len(B)):
    if B[i] == 0:
        a_zero = i  # цикл знаходить індекс першого нульового числа і записує його до змінної a_picked
        break  # після першого знайденого такого числа програма припинить пошук

for g in range(a_zero):
    if B[g] % 2 == 0: B_even.append(B[g])
    # якщо остача від ділення елементу масиву на 2 = 0, то він є парним, записуємо його до масиву A_even

print(f'\nSum of even elements in array B before the first zero: {sum(B_even)}')
print(f'Even elements in array B before the first zero: {B_even}')

