'''
Дан одновимірний масив а. Сформувати новий масив, який складається тільки з тих елементів масиву а,
які перевищують свій номер на 10. Якщо таких елементів немає, то видати повідомлення.
Bиконала Новіцька В. І. 122Б
'''
import random
while True:  # програма знаходиться в циклі, який буде виконуватись за умови, що користувач хоче виконати її знову
    A = []  # масив з 100 значеннями
    for i in range(100):
        A.append(random.randint(0, 100))  # заповнимо масив рандомними числами
    print(f'Your array: \n{A}')

    B = []  # масив, в якому знаходяться елементи, для яких виконується умова: перевищують свій номер на 10
    for i in range(len(A)):
        if A[i] - i == 10:
            B.append([A[i], i])

    if len(B) == 0:
        # якщо масив, в якому мають знаходитись елементи, для яких повинна виконуватись умова:
        # перевищують свій номер на 10, порожній, то робимо висновок, що таких елементів немає
        print('No such elements.')
    else:  # якщо він не порожній, виводимо ці елементи та їх індекси
        print(f'Such elements exist (output sample: [element, index]): {B}')

    answer = input('\nDo you want to try again? Yes-1, No-2:')
    if answer == '1':
        continue  # програма виконається знову
    else:
        break  # програма завершиться
