'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
Bиконала Новіцька В. І. 122Б
'''
A = ['Tesla', 'Acura', 'Bugatti', 'Nissan', 'Tesla', 'Peugeot']  # приклад масиву, де перший елемент повторєються
B = ['Acura', 'Bugatti', 'Nissan', 'Tesla', 'Peugeot']  # приклад масиву, де перший елемент НЕ повторєються

print(f'Array A: {A}')
print(f'Array B: {B}')


def del_el(A):  # створимо функцію, яка визначатиме, чи повторюється перший елемент, і, якщо так, то видалятиме його
    A_count = A.count(A[0])  # функція count() повертає к-ть повторів
    if A_count > 1:
        del A[0]
        print(
            f"\nFirst element {A[0]} is repeated more than once in array A. Let's delete the first element from array A: \n{A}")

    else:
        print(f'\nFirst element {A[0]} appears only once in array A.')


del_el(A)
# викличемо функцію для першого масиву, щоб побачити, що програма видалить перший елемент, якщо він повторюється
del_el(B)
# викличемо функцію для другого масиву, щоб побачити, що програма виведе повідомлення про те, що елемент не повторюється
