'''
Створіть масив А [1..8] за допомогою генератора випадкових чисел з
елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
елементів масиву.
Bиконала Новіцька В. І. 122Б
'''
import random
A = [] # масив з 8 рандомними елементами
for i in range(1, 9):
    a = random.randint(-10, 10)
    A.append(a)
print(f'Your array: \n{A}')
count = 0 # кількість від'ємних елементів
for i in A:
    if i < 0: count += 1 # якщо у масиві знайдено елемент менший за 0, у змінну count записується +1
print(f'Number of negative elements: {count}')